; domain
(define (domain rover-mining)
(:requirements :strips :negative-preconditions)
(:predicates
    ; static — the path network never changes during planning
    (CONNECTED ?from ?to)
    ; static — marks which locations are analysis laboratories
    (LAB ?loc)

    ; fluents
    (at ?rover ?loc)
    (mineral-at ?mineral ?loc)
    (free ?rover)
    (carrying ?rover ?mineral)
    (analyzed ?mineral)
)

(:action move
    :parameters (?rover ?from ?to)
    :precondition
    (and
        (at ?rover ?from)
        (CONNECTED ?from ?to)
    )
    :effect
    (and
        (not (at ?rover ?from))
        (at ?rover ?to)
    )
)

(:action pick-up
    :parameters (?rover ?mineral ?loc)
    :precondition
    (and
        (at ?rover ?loc)
        (mineral-at ?mineral ?loc)
        (free ?rover)
    )
    :effect
    (and
        (carrying ?rover ?mineral)
        (not (mineral-at ?mineral ?loc))
        (not (free ?rover))
    )
)

(:action deliver
    :parameters (?rover ?mineral ?loc)
    :precondition
    (and
        (at ?rover ?loc)
        (carrying ?rover ?mineral)
        (LAB ?loc)
    )
    :effect
    (and
        (analyzed ?mineral)
        (not (carrying ?rover ?mineral))
        (free ?rover)
    )
)

)

; problem
; Segunda variante propuesta por el alumno: se agrega un laboratorio
; adicional (l7), cercano al cluster de l1. Esto prueba que el dominio
; generaliza de verdad -- la accion "deliver" funciona en CUALQUIER
; localidad marcada (LAB ?loc), no en una unica localidad fija.
(define (problem rover-mining-p3)
(:domain rover-mining)
(:objects
    l1 l2 l3 l4 l5 l6 l7 - object
    rover1 - object
    mineral1 mineral2 mineral3 - object
)
(:init
    (CONNECTED l1 l3) (CONNECTED l3 l1)
    (CONNECTED l3 l2)
    (CONNECTED l2 l4)
    (CONNECTED l3 l4) (CONNECTED l4 l3)
    (CONNECTED l4 l5) (CONNECTED l5 l4)
    (CONNECTED l3 l6) (CONNECTED l6 l3)
    (CONNECTED l1 l7) (CONNECTED l7 l1)   ; segundo laboratorio, cerca de l1

    (LAB l5)
    (LAB l7)

    (at rover1 l4)
    (free rover1)

    (mineral-at mineral1 l1)
    (mineral-at mineral2 l2)
    (mineral-at mineral3 l6)
)
(:goal
    (and
        (analyzed mineral1)   ; se entrega en el laboratorio mas cercano, l7
        (analyzed mineral2)
        (analyzed mineral3)
    )
)
)

; plan
1. (move rover1 l4 l3)
   deleted: (at rover1 l4)
   added: (at rover1 l3)
   goals met: 0 of 3
2. (move rover1 l3 l2)
   deleted: (at rover1 l3)
   added: (at rover1 l2)
   goals met: 0 of 3
3. (pick-up rover1 mineral2 l2)
   deleted: (mineral-at mineral2 l2) (free rover1)
   added: (carrying rover1 mineral2)
   goals met: 0 of 3
4. (move rover1 l2 l4)
   deleted: (at rover1 l2)
   added: (at rover1 l4)
   goals met: 0 of 3
5. (move rover1 l4 l5)
   deleted: (at rover1 l4)
   added: (at rover1 l5)
   goals met: 0 of 3
6. (deliver rover1 mineral2 l5)
   deleted: (carrying rover1 mineral2)
   added: (analyzed mineral2) (free rover1)
   goals met: 1 of 3
7. (move rover1 l5 l4)
   deleted: (at rover1 l5)
   added: (at rover1 l4)
   goals met: 1 of 3
8. (move rover1 l4 l3)
   deleted: (at rover1 l4)
   added: (at rover1 l3)
   goals met: 1 of 3
9. (move rover1 l3 l6)
   deleted: (at rover1 l3)
   added: (at rover1 l6)
   goals met: 1 of 3
10. (pick-up rover1 mineral3 l6)
   deleted: (mineral-at mineral3 l6) (free rover1)
   added: (carrying rover1 mineral3)
   goals met: 1 of 3
11. (move rover1 l6 l3)
   deleted: (at rover1 l6)
   added: (at rover1 l3)
   goals met: 1 of 3
12. (move rover1 l3 l1)
   deleted: (at rover1 l3)
   added: (at rover1 l1)
   goals met: 1 of 3
13. (move rover1 l1 l7)
   deleted: (at rover1 l1)
   added: (at rover1 l7)
   goals met: 1 of 3
14. (deliver rover1 mineral3 l7)
   deleted: (carrying rover1 mineral3)
   added: (analyzed mineral3) (free rover1)
   goals met: 2 of 3
15. (move rover1 l7 l1)
   deleted: (at rover1 l7)
   added: (at rover1 l1)
   goals met: 2 of 3
16. (pick-up rover1 mineral1 l1)
   deleted: (mineral-at mineral1 l1) (free rover1)
   added: (carrying rover1 mineral1)
   goals met: 2 of 3
17. (move rover1 l1 l7)
   deleted: (at rover1 l1)
   added: (at rover1 l7)
   goals met: 2 of 3
18. (deliver rover1 mineral1 l7)
   deleted: (carrying rover1 mineral1)
   added: (analyzed mineral1) (free rover1)
   goals met: 3 of 3
